flit/argon-rtos/src/devices/MKL28T7/MKL28T7_CORE1.svd
        <register>
          <name>FLEXIO0_TIMCMP4</name>
          <description>Timer Compare N Register</description>
          <addressOffset>0x510</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMP</name>
              <description>Timer Compare Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXIO0_TIMCMP5</name>
          <description>Timer Compare N Register</description>
          <addressOffset>0x514</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMP</name>
              <description>Timer Compare Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXIO0_TIMCMP6</name>
          <description>Timer Compare N Register</description>
          <addressOffset>0x518</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMP</name>
              <description>Timer Compare Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXIO0_TIMCMP7</name>
          <description>Timer Compare N Register</description>
          <addressOffset>0x51C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMP</name>
              <description>Timer Compare Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXIO0_SHIFTBUFNBS0</name>
          <description>Shifter Buffer N Nibble Byte Swapped Register</description>
          <addressOffset>0x680</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHIFTBUFNBS</name>
              <description>Shift Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXIO0_SHIFTBUFNBS1</name>
          <description>Shifter Buffer N Nibble Byte Swapped Register</description>
          <addressOffset>0x684</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHIFTBUFNBS</name>
              <description>Shift Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXIO0_SHIFTBUFNBS2</name>
          <description>Shifter Buffer N Nibble Byte Swapped Register</description>
          <addressOffset>0x688</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHIFTBUFNBS</name>
              <description>Shift Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXIO0_SHIFTBUFNBS3</name>
          <description>Shifter Buffer N Nibble Byte Swapped Register</description>
          <addressOffset>0x68C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHIFTBUFNBS</name>
              <description>Shift Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXIO0_SHIFTBUFNBS4</name>
          <description>Shifter Buffer N Nibble Byte Swapped Register</description>
          <addressOffset>0x690</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHIFTBUFNBS</name>
              <description>Shift Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXIO0_SHIFTBUFNBS5</name>
          <description>Shifter Buffer N Nibble Byte Swapped Register</description>
          <addressOffset>0x694</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHIFTBUFNBS</name>
              <description>Shift Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXIO0_SHIFTBUFNBS6</name>
          <description>Shifter Buffer N Nibble Byte Swapped Register</description>
          <addressOffset>0x698</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHIFTBUFNBS</name>
              <description>Shift Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXIO0_SHIFTBUFNBS7</name>
          <description>Shifter Buffer N Nibble Byte Swapped Register</description>
          <addressOffset>0x69C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHIFTBUFNBS</name>
              <description>Shift Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXIO0_SHIFTBUFHWS0</name>
          <description>Shifter Buffer N Half Word Swapped Register</description>
          <addressOffset>0x700</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHIFTBUFHWS</name>
              <description>Shift Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXIO0_SHIFTBUFHWS1</name>
          <description>Shifter Buffer N Half Word Swapped Register</description>
          <addressOffset>0x704</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHIFTBUFHWS</name>
              <description>Shift Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXIO0_SHIFTBUFHWS2</name>
          <description>Shifter Buffer N Half Word Swapped Register</description>
          <addressOffset>0x708</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHIFTBUFHWS</name>
              <description>Shift Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXIO0_SHIFTBUFHWS3</name>
          <description>Shifter Buffer N Half Word Swapped Register</description>
          <addressOffset>0x70C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHIFTBUFHWS</name>
              <description>Shift Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXIO0_SHIFTBUFHWS4</name>
          <description>Shifter Buffer N Half Word Swapped Register</description>
          <addressOffset>0x710</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHIFTBUFHWS</name>
              <description>Shift Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXIO0_SHIFTBUFHWS5</name>
          <description>Shifter Buffer N Half Word Swapped Register</description>
          <addressOffset>0x714</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHIFTBUFHWS</name>
              <description>Shift Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXIO0_SHIFTBUFHWS6</name>
          <description>Shifter Buffer N Half Word Swapped Register</description>
          <addressOffset>0x718</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHIFTBUFHWS</name>
              <description>Shift Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXIO0_SHIFTBUFHWS7</name>
          <description>Shifter Buffer N Half Word Swapped Register</description>
          <addressOffset>0x71C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHIFTBUFHWS</name>
              <description>Shift Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXIO0_SHIFTBUFNIS0</name>
          <description>Shifter Buffer N Nibble Swapped Register</description>
          <addressOffset>0x780</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHIFTBUFNIS</name>
              <description>Shift Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXIO0_SHIFTBUFNIS1</name>
          <description>Shifter Buffer N Nibble Swapped Register</description>
          <addressOffset>0x784</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHIFTBUFNIS</name>
              <description>Shift Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXIO0_SHIFTBUFNIS2</name>
          <description>Shifter Buffer N Nibble Swapped Register</description>
          <addressOffset>0x788</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHIFTBUFNIS</name>
              <description>Shift Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXIO0_SHIFTBUFNIS3</name>
          <description>Shifter Buffer N Nibble Swapped Register</description>
          <addressOffset>0x78C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHIFTBUFNIS</name>
              <description>Shift Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXIO0_SHIFTBUFNIS4</name>
          <description>Shifter Buffer N Nibble Swapped Register</description>
          <addressOffset>0x790</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHIFTBUFNIS</name>
              <description>Shift Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXIO0_SHIFTBUFNIS5</name>
          <description>Shifter Buffer N Nibble Swapped Register</description>
          <addressOffset>0x794</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHIFTBUFNIS</name>
              <description>Shift Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXIO0_SHIFTBUFNIS6</name>
          <description>Shifter Buffer N Nibble Swapped Register</description>
          <addressOffset>0x798</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHIFTBUFNIS</name>
              <description>Shift Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXIO0_SHIFTBUFNIS7</name>
          <description>Shifter Buffer N Nibble Swapped Register</description>
          <addressOffset>0x79C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHIFTBUFNIS</name>
              <description>Shift Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
